# -*- org-return-follows-link: t; -*-
#+TITLE: container.sharing.io
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+DATE: 28th of Augest, 2023
#+PROPERTY: header-args:bash+ :results replace verbatim code output
#+PROPERTY: header-args:bash+ :var SPACE_TLD=(symbol-value 'space-domain)
#+NOPROPERTY: header-args:bash+ :var TSOCKET=(symbol-value 'tmux-socket)
#+PROPERTY: header-args:bash+ :dir (symbol-value 'tramp-dir)
#+PROPERTY: header-args:bash+ :wrap example
#+PROPERTY: header-args:bash+ :async
#+PROPERTY: header-args:shell+ :results replace verbatim code output
#+PROPERTY: header-args:shell+ :var SPACEDOMAIN=(symbol-value 'space-domain)
#+PROPERTY: header-args:shell+ :var KUBECONFIG=(concat (getenv "HOME") "/.kube/config-" space-domain)
#+NOPROPERTY: header-args:shell+ :var TSOCKET=(symbol-value 'tmux-socket)
#+PROPERTY: header-args:shell+ :async
#+NOPROPERTY: header-args:tmux+ :session "io:ssh"
#+NOPROPERTY: header-args:tmux+ :socket (symbol-value 'tmux-socket)
#+NOSTARTUP: content
#+NOSTARTUP: overview
#+NOSTARTUP: show2levels
#+STARTUP: showeverything
**** metal org
#+begin_src shell :sync
metal project get
#+end_src

#+RESULTS:
#+begin_example
+--------------------------------------+------------+----------------------+
|                  ID                  |    NAME    |       CREATED        |
+--------------------------------------+------------+----------------------+
| 82b5c425-8dd4-429e-ae0d-d32f265c63e4 | sharing.io | 2023-06-16T19:54:45Z |
+--------------------------------------+------------+----------------------+
#+end_example

**** ip
#+name: ip
#+begin_src shell :sync
metal device get --filter hostname=cp1.container.sharing.io -o json | jq '.[0].ip_addresses[0].address' -r
#+end_src

#+RESULTS: ip
#+begin_example
136.144.49.79
#+end_example
**** id
#+name: id
#+begin_src shell :sync
metal device get --filter hostname=cp1.container.sharing.io -o json | jq -r '.[0].id'
#+end_src

#+RESULTS: id
#+begin_example
eb8a09d1-5c5d-45bc-9961-e04ac23f9e4b
#+end_example
**** facility
#+name: facility
#+begin_src shell :sync
metal device get --filter hostname=cp1.container.sharing.io -o json | jq -r '.[0].facility.code'
#+end_src

#+RESULTS: facility
#+begin_example
fr2
#+end_example

**** device
#+name: id
#+begin_src shell :sync
metal device get
#+end_src

#+RESULTS: id
#+begin_example
+--------------------------------------+----------------+-------------+--------+----------------------+
|                  ID                  |    HOSTNAME    |     OS      | STATE  |       CREATED        |
+--------------------------------------+----------------+-------------+--------+----------------------+
| 905bd051-e623-4f82-997f-b7d6b352d218 | nix.sharing.io | NixOS 23.05 | active | 2023-09-09T08:32:11Z |
+--------------------------------------+----------------+-------------+--------+----------------------+
#+end_example
** Domain
NS Records and a separate tsig key are configured on powerdns.ii.nz
#+name: spacedomain
#+begin_src bash :wrap "example" :sync :cache yes
echo -n $SPACE_TLD
#+end_src

#+RESULTS[3e90bcba2041cbd062d8f655fe5492b84380ff86]: spacedomain
#+begin_example
container.sharing.io
#+end_example

** What is our IP?
#+begin_src shell :sync
metal device get --filter hostname=cp1.container.sharing.io -o json | jq '.[0].ip_addresses[0].address' -r
#+end_src

#+RESULTS:
#+begin_example
136.144.49.79
#+end_example

** Add DOMAIN -> Address pointing our IP
We did this via the GUI, but here is the verified result.
#+name: add main A record
#+begin_src shell :sync
dig A $SPACE_TLD +short @ns.ii.nz
#+end_src

#+RESULTS: add main A record
#+begin_example
145.40.113.253
#+end_example

** Add *.DOMAIN -> Address pointing to our IP
#+name: add wildcard A record
#+begin_src shell :sync
dig A random123.$SPACE_TLD +short
#+end_src

#+RESULTS: add wildcard A record
#+begin_example
145.40.113.253
#+end_example
** Pull down kubernetes container images
#+begin_src bash :sync
kubeadm config images pull
#+end_src

#+RESULTS:
#+begin_example
[config/images] Pulled registry.k8s.io/kube-apiserver:v1.28.1
[config/images] Pulled registry.k8s.io/kube-controller-manager:v1.28.1
[config/images] Pulled registry.k8s.io/kube-scheduler:v1.28.1
[config/images] Pulled registry.k8s.io/kube-proxy:v1.28.1
[config/images] Pulled registry.k8s.io/pause:3.9
[config/images] Pulled registry.k8s.io/etcd:3.5.9-0
[config/images] Pulled registry.k8s.io/coredns/coredns:v1.10.1
#+end_example

** Inspect kubernetes container images
#+begin_src bash :sync
sudo crictl images
#+end_src

#+RESULTS:
#+begin_example
IMAGE                                     TAG                 IMAGE ID            SIZE
registry.k8s.io/coredns/coredns           v1.10.1             ead0a4a53df89       16.2MB
registry.k8s.io/etcd                      3.5.9-0             73deb9a3f7025       103MB
registry.k8s.io/kube-apiserver            v1.28.1             5c801295c21d0       34.6MB
registry.k8s.io/kube-controller-manager   v1.28.1             821b3dfea27be       33.4MB
registry.k8s.io/kube-proxy                v1.28.1             6cdbabde3874e       24.6MB
registry.k8s.io/kube-scheduler            v1.28.1             b462ce0c8b1ff       18.8MB
registry.k8s.io/pause                     3.9                 e6f1816883972       322kB
#+end_example

** Gateway API
- https://isovalent.com/blog/post/tutorial-getting-started-with-the-cilium-gateway-api/
Looks like there's a new version at:
- https://gateway-api.sigs.k8s.io/guides/#install-standard-channel

#+begin_src tmux
kubectl apply -f  \
    https://github.com/kubernetes-sigs/gateway-api/releases/download/v0.7.1/experimental-install.yaml
#+end_src

#+RESULTS:
#+begin_example
customresourcedefinition.apiextensions.k8s.io/gatewayclasses.gateway.networking.k8s.io created
customresourcedefinition.apiextensions.k8s.io/gateways.gateway.networking.k8s.io created
customresourcedefinition.apiextensions.k8s.io/httproutes.gateway.networking.k8s.io created
customresourcedefinition.apiextensions.k8s.io/referencegrants.gateway.networking.k8s.io created
namespace/gateway-system created
validatingwebhookconfiguration.admissionregistration.k8s.io/gateway-api-admission created
service/gateway-api-admission-server created
deployment.apps/gateway-api-admission-server created
serviceaccount/gateway-api-admission created
clusterrole.rbac.authorization.k8s.io/gateway-api-admission created
clusterrolebinding.rbac.authorization.k8s.io/gateway-api-admission created
role.rbac.authorization.k8s.io/gateway-api-admission created
rolebinding.rbac.authorization.k8s.io/gateway-api-admission created
job.batch/gateway-api-admission created
job.batch/gateway-api-admission-patch created
#+end_example

** increase maxPods
Our nodes usually run a lot of pods, so the default of 110 is way to low, so we bump it by a magnitude of roughly ten.

https://prefetch.net/blog/2018/02/10/the-kubernetes-110-pod-limit-per-node/

It needs to be set in the kublet config file:
https://kubernetes.io/docs/reference/config-api/kubelet-config.v1beta1/

Ideally we set this via kubeadm, but for now manually add it and restart kubelet.
#+begin_src shell :eval never
echo maxPods: 1024 >> /var/lib/kubelet/config.yaml
#+end_src

#+begin_src bash :sync
grep maxPods /var/lib/kubelet/config.yaml
#+end_src

#+RESULTS:
#+begin_example
maxPods: 1024
#+end_example

#+begin_src bash :eval never
systemctl restart kubelet
#+end_src

#+begin_src bash :sync
kubectl describe nodes  | grep Capacity: -A6
#+end_src

#+RESULTS:
#+begin_example
Capacity:
  cpu:                64
  ephemeral-storage:  227158056Ki
  hugepages-1Gi:      0
  hugepages-2Mi:      0
  memory:             263515036Ki
  pods:               1024
#+end_example

*** temporary fix
#+begin_src bash
sysctl fs.inotify.max_user_watches=524288
sysctl fs.inotify.max_user_instances=512
#+end_src

#+RESULTS:
#+begin_example
fs.inotify.max_user_watches = 524288
fs.inotify.max_user_instances = 512
#+end_example

*** persistent fix
To make the changes persistent, edit the file /etc/sysctl.d/99-maxnotify.conf and add these lines:
#+begin_src toml :tangle (concat tramp-dir "etc/sysctl.d/99-maxnotify.conf") :comments no
fs.inotify.max_user_watches = 524288
fs.inotify.max_user_instances = 512
#+end_src
You will then need load settings from that file:
#+begin_src shell
sysctl --system
#+end_src

#+RESULTS:
#+begin_example
#+end_example

*** verify
#+begin_src bash :sync
sysctl get fs.inotify.max_user_watches
sysctl get fs.inotify.max_user_instances
#+end_src

#+RESULTS:
#+begin_example
fs.inotify.max_user_watches = 524288
fs.inotify.max_user_instances = 512
#+end_example

*** list gpg keys
#+begin_src tmux :env KEY_NAME="k8s.container.sharing.io" :sync
export KEY_NAME="k8s.container.sharing.io"
gpg --list-secret-keys "${KEY_NAME}"
#+end_src

#+RESULTS:
#+begin_example
sec   rsa4096 2023-08-28 [SCEAR]
      6CFB156EEFE7417E2567D5FD37732CFA004DC229
uid           [ultimate] k8s.uk.sharing.io (flux secrets)
ssb   rsa4096 2023-08-28 [SEAR]

#+end_example

*** import into kubernetes
#+begin_src tmux :env KEY_NAME="k8s.container.sharing.io" :sync
export KEY_NAME="k8s.container.sharing.io"
export KEY_FP=$(gpg --list-secret-keys "${KEY_NAME}" | grep SCEA -A1 | tail -1 | awk '{print $1}')
kubectl delete secret sops-gpg --namespace=flux-system || true
gpg --export-secret-keys --armor "${KEY_FP}" |
kubectl create secret generic sops-gpg \
--namespace=flux-system \
--from-file=sops.asc=/dev/stdin
#+end_src

#+RESULTS:
#+begin_example
#+end_example

*** create a zone with NS
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -ti -- \
  pdnsutil create-zone sharing.io ns.ii.coop
#+end_src

#+RESULTS:
#+begin_example
Also adding one NS record
#+end_example
**** add second NS to zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -ti -- \
  pdnsutil add-record sharing.io @ NS ns.workshop.coop.
#+end_src

#+RESULTS:
#+begin_example
New rrset:
sharing.io. 3600 IN NS ns.ii.coop
sharing.io. 3600 IN NS ns.workshop.coop
#+end_example
**** add A for zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
  pdnsutil add-record sharing.io @ A 136.144.49.79
#+end_src

#+RESULTS:
#+begin_example
New rrset:
sharing.io. 3600 IN A 136.144.49.79
#+end_example
**** add wildcard A for zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
  pdnsutil add-record sharing.io '*' A 136.144.49.79
#+end_src

#+RESULTS:
#+begin_example
New rrset:
,*.sharing.io. 3600 IN A 136.144.49.79
#+end_example
**** list zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil list-zone sharing.io
#+end_src

#+RESULTS:
#+begin_example
$ORIGIN .
,*.sharing.io	3600	IN	A	136.144.49.79
sharing.io	3600	IN	A	136.144.49.79
sharing.io	3600	IN	NS	ns.ii.coop.
sharing.io	3600	IN	NS	ns.workshop.coop.
sharing.io	3600	IN	SOA	ns.sharing.io hostmaster.sharing.io 0 10800 3600 604800 3600
#+end_example
**** import-tsig-key (from vars)
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil import-tsig-key $PDNS_TSIG_KEYNAME $PDNS_TSIG_ALGO $PDNS_TSIG_KEY
#+end_src

#+RESULTS:
#+begin_example
Imported TSIG key sharing.io hmac-sha256
#+end_example
**** activate-tsig-key
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil activate-tsig-key $DNS_ZONE $PDNS_TSIG_KEYNAME primary
#+end_src

#+RESULTS:
#+begin_example
Enabled TSIG key sharing.io for sharing.io
#+end_example
**** activate-tsig-key
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
 pdnsutil set-meta $DNS_ZONE TSIG-ALLOW-DNSUPDATE $PDNS_TSIG_KEYNAME
#+end_src

#+RESULTS:
#+begin_example
Set 'sharing.io' meta TSIG-ALLOW-DNSUPDATE = sharing.io
#+end_example

**** show zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil show-zone sharing.io
#+end_src

#+RESULTS:
#+begin_example
This is a Native zone
Zone is not actively secured
Zone has following allowed TSIG key(s): sharing.io
Metadata items:
	TSIG-ALLOW-AXFR	sharing.io
	TSIG-ALLOW-DNSUPDATE	sharing.io
#+end_example
**** get meta
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil get-meta sharing.io
#+end_src

#+RESULTS:
#+begin_example
Metadata for 'sharing.io'
TSIG-ALLOW-AXFR = sharing.io
TSIG-ALLOW-DNSUPDATE = sharing.io
#+end_example

**** check all zones
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil check-all-zones
#+end_src

#+RESULTS:
#+begin_example
Checked 5 records of 'sharing.io', 0 errors, 0 warnings.
Checked 1 zones, 0 had errors.
#+end_example

*** nsupdate using TSIG_KEY
#+begin_src shell :epilogue "\n) 2>&1\n:\n" :prologue "(\nexport KUBECONFIG\n" :wrap "example" :sync
nsupdate -y "$PDNS_TSIG_ALGO:$PDNS_TSIG_KEYNAME:$PDNS_TSIG_KEY" <<EOF
update add localhost.$DNS_ZONE 60 A 127.0.0.1
send
EOF
#+end_src

#+RESULTS:
#+begin_example
#+end_example

*** show zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil show-zone sharing.io
#+end_src

#+RESULTS:
#+begin_example
This is a Native zone
Zone is not actively secured
Zone has following allowed TSIG key(s): sharing.io
Metadata items:
	TSIG-ALLOW-AXFR	sharing.io
	TSIG-ALLOW-DNSUPDATE	sharing.io
#+end_example

*** create NS records for new zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -ti -- \
  pdnsutil add-record container.sharing.io @ NS ns.workshop.coop.
kubectl -n powerdns exec svc/auth-dns -ti -- \
  pdnsutil add-record container.sharing.io @ NS ns.ii.coop.
#+end_src

#+RESULTS:
#+begin_example
New rrset:
container.sharing.io. 3600 IN NS ns.ii.coop
container.sharing.io. 3600 IN NS ns.workshop.coop
container.sharing.io. 3600 IN NS ns.workshop.coop
#+end_example

*** create a zone with NS
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -ti -- \
  pdnsutil create-zone container.sharing.io ns.ii.coop
#+end_src

#+RESULTS:
#+begin_example
Also adding one NS record
#+end_example
**** add second NS to zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -ti -- \
  pdnsutil add-record container.sharing.io @ NS ns.workshop.coop.
#+end_src

#+RESULTS:
#+begin_example
New rrset:
container.sharing.io. 3600 IN NS ns.ii.coop
container.sharing.io. 3600 IN NS ns.workshop.coop
#+end_example

**** add A for zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
  pdnsutil add-record container.sharing.io @ A 136.144.49.79
#+end_src

#+RESULTS:
#+begin_example
New rrset:
container.sharing.io. 3600 IN A 136.144.49.79
#+end_example
**** add wildcard A for zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
  pdnsutil add-record container.sharing.io '*' A 136.144.49.79
#+end_src

#+RESULTS:
#+begin_example
New rrset:
,*.container.sharing.io. 3600 IN A 136.144.49.79
#+end_example
**** list zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil list-zone container.sharing.io
#+end_src

#+RESULTS:
#+begin_example
$ORIGIN .
,*.container.sharing.io	3600	IN	A	136.144.49.79
container.sharing.io	3600	IN	A	136.144.49.79
container.sharing.io	3600	IN	NS	ns.ii.coop.
container.sharing.io	3600	IN	NS	ns.workshop.coop.
container.sharing.io	3600	IN	SOA	ns.sharing.io hostmaster.sharing.io 0 10800 3600 604800 3600
#+end_example
**** activate-tsig-key
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil activate-tsig-key container.$DNS_ZONE $PDNS_TSIG_KEYNAME primary
#+end_src

#+RESULTS:
#+begin_example
Enabled TSIG key sharing.io for container.sharing.io
#+end_example
**** tsig-allow-dnsupdate
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
 pdnsutil set-meta container.$DNS_ZONE TSIG-ALLOW-DNSUPDATE $PDNS_TSIG_KEYNAME
#+end_src

#+RESULTS:
#+begin_example
Set 'container.sharing.io' meta TSIG-ALLOW-DNSUPDATE = sharing.io
#+end_example
**** get meta
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil get-meta container.sharing.io
#+end_src

#+RESULTS:
#+begin_example
Metadata for 'container.sharing.io'
TSIG-ALLOW-AXFR = sharing.io
TSIG-ALLOW-DNSUPDATE = sharing.io
#+end_example


**** import-tsig-key (from vars)
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil import-tsig-key $PDNS_TSIG_KEYNAME $PDNS_TSIG_ALGO $PDNS_TSIG_KEY
#+end_src

#+RESULTS:
#+begin_example
Imported TSIG key sharing.io hmac-sha256
#+end_example
**** activate-tsig-key
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil activate-tsig-key $DNS_ZONE $PDNS_TSIG_KEYNAME primary
#+end_src

#+RESULTS:
#+begin_example
Enabled TSIG key sharing.io for sharing.io
#+end_example
**** tsig-allow-dnsupdate
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
 pdnsutil set-meta $DNS_ZONE TSIG-ALLOW-DNSUPDATE $PDNS_TSIG_KEYNAME
#+end_src

#+RESULTS:
#+begin_example
Set 'sharing.io' meta TSIG-ALLOW-DNSUPDATE = sharing.io
#+end_example

**** show zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil show-zone sharing.io
#+end_src

#+RESULTS:
#+begin_example
This is a Native zone
Zone is not actively secured
Zone has following allowed TSIG key(s): sharing.io
Metadata items:
	TSIG-ALLOW-AXFR	sharing.io
	TSIG-ALLOW-DNSUPDATE	sharing.io
#+end_example
**** get meta
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil get-meta sharing.io
#+end_src

#+RESULTS:
#+begin_example
Metadata for 'sharing.io'
TSIG-ALLOW-AXFR = sharing.io
TSIG-ALLOW-DNSUPDATE = sharing.io
#+end_example

**** check all zones
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil check-all-zones
#+end_src

#+RESULTS:
#+begin_example
Checked 5 records of 'sharing.io', 0 errors, 0 warnings.
Checked 1 zones, 0 had errors.
#+end_example

*** nsupdate using TSIG_KEY
#+begin_src shell :epilogue "\n) 2>&1\n:\n" :prologue "(\nexport KUBECONFIG\n" :wrap "example" :sync
nsupdate -y "$PDNS_TSIG_ALGO:$PDNS_TSIG_KEYNAME:$PDNS_TSIG_KEY" <<EOF
update add localhost.$DNS_ZONE 60 A 127.0.0.1
send
EOF
#+end_src

#+RESULTS:
#+begin_example
#+end_example

*** show zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil show-zone sharing.io
#+end_src

#+RESULTS:
#+begin_example
This is a Native zone
Zone is not actively secured
Zone has following allowed TSIG key(s): sharing.io
Metadata items:
	TSIG-ALLOW-AXFR	sharing.io
	TSIG-ALLOW-DNSUPDATE	sharing.io
#+end_example

*** create NS records for new zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -ti -- \
  pdnsutil add-record uk.sharing.io @ NS ns.workshop.coop.
kubectl -n powerdns exec svc/auth-dns -ti -- \
  pdnsutil add-record uk.sharing.io @ NS ns.ii.coop.
#+end_src

#+RESULTS:
#+begin_example
New rrset:
uk.sharing.io. 3600 IN NS ns.workshop.coop
uk.sharing.io. 3600 IN NS ns.ii.coop
uk.sharing.io. 3600 IN NS ns.workshop.coop
#+end_example

*** create a zone with NS
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -ti -- \
  pdnsutil create-zone uk.sharing.io ns.ii.coop
#+end_src

#+RESULTS:
#+begin_example
Also adding one NS record
#+end_example
**** add second NS to zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -ti -- \
  pdnsutil add-record uk.sharing.io @ NS ns.workshop.coop.
#+end_src

#+RESULTS:
#+begin_example
New rrset:
uk.sharing.io. 3600 IN NS ns.workshop.coop
#+end_example

**** add second NS to zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -ti -- \
  pdnsutil add-record uk.sharing.io @ NS ns.ii.coop.
#+end_src

#+RESULTS:
#+begin_example
New rrset:
uk.sharing.io. 3600 IN NS ns.workshop.coop
uk.sharing.io. 3600 IN NS ns.ii.coop
#+end_example

**** add A for zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
  pdnsutil add-record uk.sharing.io @ A 145.40.113.253
#+end_src

#+RESULTS:
#+begin_example
New rrset:
uk.sharing.io. 3600 IN A 145.40.113.253
#+end_example
**** add wildcard A for zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
  pdnsutil add-record uk.sharing.io '*' A 145.40.113.253
#+end_src

#+RESULTS:
#+begin_example
New rrset:
,*.uk.sharing.io. 3600 IN A 145.40.113.253
#+end_example
**** list zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil list-zone uk.sharing.io
#+end_src

#+RESULTS:
#+begin_example
$ORIGIN .
,*.uk.sharing.io	3600	IN	A	145.40.113.253
uk.sharing.io	3600	IN	A	145.40.113.253
uk.sharing.io	3600	IN	NS	ns.workshop.coop.
uk.sharing.io	3600	IN	NS	ns.ii.coop.
uk.sharing.io	3600	IN	SOA	ns.sharing.io hostmaster.sharing.io 0 10800 3600 604800 3600
#+end_example
**** activate-tsig-key
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil activate-tsig-key uk.$DNS_ZONE $PDNS_TSIG_KEYNAME primary
#+end_src

#+RESULTS:
#+begin_example
Enabled TSIG key sharing.io for uk.sharing.io
#+end_example
**** tsig-allow-dnsupdate
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
 pdnsutil set-meta uk.$DNS_ZONE TSIG-ALLOW-DNSUPDATE $PDNS_TSIG_KEYNAME
#+end_src

#+RESULTS:
#+begin_example
Set 'uk.sharing.io' meta TSIG-ALLOW-DNSUPDATE = sharing.io
#+end_example
**** get meta
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil get-meta uk.sharing.io
#+end_src

#+RESULTS:
#+begin_example
Metadata for 'uk.sharing.io'
TSIG-ALLOW-AXFR = sharing.io
TSIG-ALLOW-DNSUPDATE = sharing.io
#+end_example

**** import-tsig-key (from vars)
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil import-tsig-key $PDNS_TSIG_KEYNAME $PDNS_TSIG_ALGO $PDNS_TSIG_KEY
#+end_src

#+RESULTS:
#+begin_example
Imported TSIG key sharing.io hmac-sha256
#+end_example
**** activate-tsig-key
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil activate-tsig-key $DNS_ZONE $PDNS_TSIG_KEYNAME primary
#+end_src

#+RESULTS:
#+begin_example
Enabled TSIG key sharing.io for sharing.io
#+end_example
**** tsig-allow-dnsupdate
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
 pdnsutil set-meta $DNS_ZONE TSIG-ALLOW-DNSUPDATE $PDNS_TSIG_KEYNAME
#+end_src

#+RESULTS:
#+begin_example
Set 'sharing.io' meta TSIG-ALLOW-DNSUPDATE = sharing.io
#+end_example

**** show zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil show-zone sharing.io
#+end_src

#+RESULTS:
#+begin_example
This is a Native zone
Zone is not actively secured
Zone has following allowed TSIG key(s): sharing.io
Metadata items:
	TSIG-ALLOW-AXFR	sharing.io
	TSIG-ALLOW-DNSUPDATE	sharing.io
#+end_example
**** get meta
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil get-meta sharing.io
#+end_src

#+RESULTS:
#+begin_example
Metadata for 'sharing.io'
TSIG-ALLOW-AXFR = sharing.io
TSIG-ALLOW-DNSUPDATE = sharing.io
#+end_example

**** check all zones
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil check-all-zones
#+end_src

#+RESULTS:
#+begin_example
Checked 5 records of 'sharing.io', 0 errors, 0 warnings.
Checked 1 zones, 0 had errors.
#+end_example

*** nsupdate using TSIG_KEY
#+begin_src shell :epilogue "\n) 2>&1\n:\n" :prologue "(\nexport KUBECONFIG\n" :wrap "example" :sync
nsupdate -y "$PDNS_TSIG_ALGO:$PDNS_TSIG_KEYNAME:$PDNS_TSIG_KEY" <<EOF
update add localhost.$DNS_ZONE 60 A 127.0.0.1
send
EOF
#+end_src

#+RESULTS:
#+begin_example
#+end_example

*** show zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil show-zone sharing.io
#+end_src

#+RESULTS:
#+begin_example
This is a Native zone
Zone is not actively secured
Zone has following allowed TSIG key(s): sharing.io
Metadata items:
	TSIG-ALLOW-AXFR	sharing.io
	TSIG-ALLOW-DNSUPDATE	sharing.io
#+end_example

*** set TSIG-ALLOW-DNSUPDATE
#+begin_src shell :epilogue "\n) 2>&1\n:\n" :prologue "(\n" :sync
curl -L -s \
    -H "X-API-Key: $PDNS_API_KEY" \
    -H "Content-Type: application/json" \
    -d "{\"kind\": \"TSIG-ALLOW-DNSUPDATE\", \"metadata\": [\"${PDNS_TSIG_KEYNAME}.\"]}" \
    http://localhost:8081/api/v1/servers/localhost/$DNS_ZONE/metadata \
    # | jq .
#+end_src

#+RESULTS:
#+begin_example
Not Found
#+end_example
** list zone
#+begin_src shell :sync
kubectl -n powerdns exec svc/auth-dns -- \
    pdnsutil list-zone sharing.io
#+end_src

#+RESULTS:
#+begin_example
$ORIGIN .
localhost.sharing.io	60	IN	A	127.0.0.1
,*.sharing.io	3600	IN	A	136.144.49.79
sharing.io	3600	IN	A	136.144.49.79
sharing.io	3600	IN	NS	ns.ii.coop.
sharing.io	3600	IN	NS	ns.workshop.coop.
sharing.io	3600	IN	SOA	ns.sharing.io hostmaster.sharing.io 2023091101 10800 3600 604800 3600
#+end_example
** mc alias
#+begin_src shell
mc alias set min https://s3.uk.sharing.io $MINIO_ROOT_USER $MINIO_ROOT_PASSWORD
#+end_src

#+RESULTS:
#+begin_example
Added `min` successfully.
#+end_example
** mc mb min
#+begin_src shell
mc mb min/sharingio
#+end_src

#+RESULTS:
#+begin_example
Bucket created successfully `uk/sharingio`.
#+end_example

** mc ls min
#+begin_src shell
mc ls min
#+end_src

#+RESULTS:
#+begin_example
[2023-08-23 10:56:26 BST]     0B sharingio/
#+end_example

*** the secret
It's a single key, but it contains the text of the env.
#+begin_src shell :sync
 kubectl -n minio describe secret minio-env-config
#+end_src

#+RESULTS:
#+begin_example
Name:         minio-env-config
Namespace:    minio
Labels:       kustomize.toolkit.fluxcd.io/name=secrets
              kustomize.toolkit.fluxcd.io/namespace=flux-system
Annotations:  <none>

Type:  Opaque

Data
====
config.env:  319 bytes
#+end_example

*** the secret
Longhorn wants a minio secret to backup to
#+begin_src shell :sync
 kubectl -n longhorn describe secret longhorn-minio
#+end_src

#+RESULTS:
#+begin_example
#+end_example

** OIDC
https://goauthentik.io/integrations/services/minio/
#+begin_src shell
mc mb uk/abcs
#+end_src

#+RESULTS:
#+begin_example
Bucket created successfully `uk/abcs`.
#+end_example

https://min.io/docs/minio/linux/operations/external-iam/configure-openid-external-identity-management.html
*** get the ingress
#+begin_src shell :epilogue "\n) 2>&1\n:\n" :prologue "(\nexport KUBECONFIG\n" :dir . :sync
kubectl -n flux-system get ingress webhook-receiver
#+end_src

#+RESULTS:
#+begin_example
NAME               CLASS   HOSTS                               ADDRESS         PORTS     AGE
webhook-receiver   nginx   flux-webhook.container.sharing.io   136.144.49.79   80, 443   3m35s
#+end_example

*** get the hook path
We need to encrypt the secret with sops and commit/push so flux can decrypt and apply it
#+begin_src shell :epilogue "\n) 2>&1\n:\n" :prologue "(\nexport KUBECONFIG\n" :dir . :sync
kubectl -n flux-system get receiver
#+end_src

#+RESULTS:
#+begin_example
NAME              AGE     READY   STATUS
github-receiver   6m43s   True    Receiver initialized for path: /hook/e40123b877be41ea5bf7c2712ebf1fbaec7a0176e1342f60c1848bf8b25b1fbb
#+end_example
*** combine them into something like
Use the Secret and this PayloadURL to create a new webook:
[[https://github.com/sharingio/infra/settings/hooks]]
[[https://github.com/sharingio/infra/settings/hooks/new]]
#+begin_src shell :epilogue "\n) 2>&1\n:\n" :prologue "(\nexport KUBECONFIG\n" :dir . :sync
echo PayloadURL: https://$(kubectl -n flux-system get ingress webhook-receiver -o jsonpath="{.spec.rules[0].host}")$(kubectl -n flux-system get receiver github-receiver -o jsonpath="{.status.webhookPath}")
#+end_src

#+RESULTS:
#+begin_example
PayloadURL: https://flux-webhook.container.sharing.io/hook/e40123b877be41ea5bf7c2712ebf1fbaec7a0176e1342f60c1848bf8b25b1fbb
#+end_example
*** import into kubernetes
#+begin_src shell :env KEY_NAME="k8s.uk.sharing.io"
export KEY_NAME="k8s.uk.sharing.io"
export KEY_FP=$(gpg --list-secret-keys "${KEY_NAME}" | grep SCEAR -A1 | tail -1 | awk '{print $1}')
gpg --export-secret-keys --armor "${KEY_FP}" |
kubectl create secret generic sops-gpg \
--namespace=flux-system \
--from-file=sops.asc=/dev/stdin
#+end_src

#+RESULTS:
#+begin_example
secret/sops-gpg created
#+end_example
*** describe coder secret
Mostly we map the env vars directly.
#+begin_src bash :sync :dir .
kubectl -n coder describe secret coder
#+end_src

#+RESULTS:
#+begin_example
Name:         coder
Namespace:    coder
Labels:       kustomize.toolkit.fluxcd.io/name=secrets
              kustomize.toolkit.fluxcd.io/namespace=flux-system
Annotations:  <none>

Type:  Opaque

Data
====
CODER_OIDC_CLIENT_ID:               40 bytes
GITHUB_TOKEN:                       93 bytes
METAL_AUTH_TOKEN:                   32 bytes
PDNS_API_KEY:                       8 bytes
CODER_GITAUTH_0_CLIENT_ID:          20 bytes
CODER_GITAUTH_0_CLIENT_SECRET:      40 bytes
CODER_OAUTH2_GITHUB_CLIENT_ID:      20 bytes
CODER_OAUTH2_GITHUB_CLIENT_SECRET:  40 bytes
postgres-password:                  12 bytes
CODER_OIDC_CLIENT_SECRET:           128 bytes
CODER_PG_CONNECTION_URL:            103 bytes
PDNS_TSIG_KEY:                      88 bytes
password:                           12 bytes
#+end_example

